stevenj/avr-libc3/include/avr/io/attiny861.h
/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE       _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCMSK1     _SFR_MEM8 (0x0042) /* Pin Change Enable Mask 1 */
#define EXINT_PCMSK0     _SFR_MEM8 (0x0043) /* Pin Change Enable Mask 0 */
#define EXINT_MCUCR      _SFR_MEM8 (0x0055) /* MCU Control Register */
#define EXINT_GIFR       _SFR_MEM8 (0x005A) /* General Interrupt Flag register */
#define EXINT_GIMSK      _SFR_MEM8 (0x005B) /* General Interrupt Mask Register */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE         _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_GPIOR0       _SFR_MEM8 (0x002A) /* General purpose register 0 */
#define CPU_GPIOR1       _SFR_MEM8 (0x002B) /* General Purpose register 1 */
#define CPU_GPIOR2       _SFR_MEM8 (0x002C) /* General Purpose IO register 2 */
#define CPU_DWDR         _SFR_MEM8 (0x0040) /* debugWire data register */
#define CPU_CLKPR        _SFR_MEM8 (0x0048) /* Clock Prescale Register */
#define CPU_PLLCSR       _SFR_MEM8 (0x0049) /* PLL Control and status register */
#define CPU_OSCCAL       _SFR_MEM8 (0x0051) /* Oscillator Calibration Register */
#define CPU_MCUSR        _SFR_MEM8 (0x0054) /* MCU Status register */
#define CPU_MCUCR        _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_PRR          _SFR_MEM8 (0x0056) /* Power Reduction Register */
#define CPU_SP           _SFR_MEM16(0x005D) /* Stack Pointer  Bytes */
#define CPU_SPL          _SFR_MEM8 (0x005D) /* Stack Pointer  Bytes LOW BYTE */
#define CPU_SPH          _SFR_MEM8 (0x005E) /* Stack Pointer  Bytes HIGH BYTE */
#define CPU_SREG         _SFR_MEM8 (0x005F) /* Status Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE        _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW         _SFR_MEM8 (0x0000) 
#define FUSE_HIGH        _SFR_MEM8 (0x0001) 
#define FUSE_EXTENDED    _SFR_MEM8 (0x0002) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE     _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT  _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num            (0)                 
#define None_RESET_vect                _VECTOR(0)          /* External Reset, Power-on Reset and Watchdog Reset */
#define None_INT0_vect_num             (1)                 
#define None_INT0_vect                 _VECTOR(1)          /* External Interrupt 0 */
#define None_PCINT_vect_num            (2)                 
#define None_PCINT_vect                _VECTOR(2)          /* Pin Change Interrupt */
#define None_TIMER1_COMPA_vect_num     (3)                 
#define None_TIMER1_COMPA_vect         _VECTOR(3)          /* Timer/Counter1 Compare Match 1A */
#define None_TIMER1_COMPB_vect_num     (4)                 
#define None_TIMER1_COMPB_vect         _VECTOR(4)          /* Timer/Counter1 Compare Match 1B */
#define None_TIMER1_OVF_vect_num       (5)                 
#define None_TIMER1_OVF_vect           _VECTOR(5)          /* Timer/Counter1 Overflow */
#define None_TIMER0_OVF_vect_num       (6)                 
#define None_TIMER0_OVF_vect           _VECTOR(6)          /* Timer/Counter0 Overflow */
#define None_USI_START_vect_num        (7)                 
#define None_USI_START_vect            _VECTOR(7)          /* USI Start */
#define None_USI_OVF_vect_num          (8)                 
#define None_USI_OVF_vect              _VECTOR(8)          /* USI Overflow */
#define None_EE_RDY_vect_num           (9)                 
#define None_EE_RDY_vect               _VECTOR(9)          /* EEPROM Ready */
#define None_ANA_COMP_vect_num         (10)                
#define None_ANA_COMP_vect             _VECTOR(10)         /* Analog Comparator */
#define None_ADC_vect_num              (11)                
#define None_ADC_vect                  _VECTOR(11)         /* ADC Conversion Complete */
#define None_WDT_vect_num              (12)                
#define None_WDT_vect                  _VECTOR(12)         /* Watchdog Time-Out */
#define None_INT1_vect_num             (13)                
#define None_INT1_vect                 _VECTOR(13)         /* External Interrupt 1 */
#define None_TIMER0_COMPA_vect_num     (14)                
#define None_TIMER0_COMPA_vect         _VECTOR(14)         /* Timer/Counter0 Compare Match A */
#define None_TIMER0_COMPB_vect_num     (15)                
#define None_TIMER0_COMPB_vect         _VECTOR(15)         /* Timer/Counter0 Compare Match B */
#define None_TIMER0_CAPT_vect_num      (16)                
#define None_TIMER0_CAPT_vect          _VECTOR(16)         /* ADC Conversion Complete */
#define None_TIMER1_COMPD_vect_num     (17)                
#define None_TIMER1_COMPD_vect         _VECTOR(17)         /* Timer/Counter1 Compare Match D */
#define None_FAULT_PROTECTION_vect_num (18)                
#define None_FAULT_PROTECTION_vect     _VECTOR(18)         /* Timer/Counter1 Fault Protection */

/* Vector Table Size */
#define _VECTOR_SIZE                   (2)                 /* Size of individual vector. */
#define _VECTORS_SIZE                  (19 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START   (0x0000)                           
#define PROGMEM_SIZE    (0x2000)                           
#define PROGMEM_END     (PROGMEM_START + PROGMEM_SIZE - 1) 

#define FLASH_START     (0x0000)                           
#define FLASH_SIZE      (0x2000)                           
#define FLASH_PAGE_SIZE (0x0040)                           
#define FLASH_END       (FLASH_START + FLASH_SIZE - 1)     

#define SIGNATURESMEM_START  (0x0000)                                       
#define SIGNATURESMEM_SIZE   (0x0003)                                       
#define SIGNATURESMEM_END    (SIGNATURESMEM_START + SIGNATURESMEM_SIZE - 1) 

#define SIGNATURES_START     (0x0000)                                       
#define SIGNATURES_SIZE      (0x0003)                                       
#define SIGNATURES_PAGE_SIZE (0x0001)                                       
#define SIGNATURES_END       (SIGNATURES_START + SIGNATURES_SIZE - 1)       

#define FUSESMEM_START  (0x0000)                             
#define FUSESMEM_SIZE   (0x0003)                             
#define FUSESMEM_END    (FUSESMEM_START + FUSESMEM_SIZE - 1) 

